###1418083 최희태 구구단 거꾸로

for i in range(9,1,-1):
    print("--- %d 단 ---" % i)
    for j in range(9,1,-1):
        print("%d * %d = %d" %(i,j,i*j))
    print()

print("------------------------------------------------------------------------------------------")


for i in range(9,1,-1):
    for j in range(9,1,-1):
        print("%2d * %2d = %2d" %(j,i,i*j),end= " ") ###2d로 자리수 정해주기
    print()



print("------------------------------------------------------------------------------------------")
for i in range(10):
    for j in range(10):
        print("#" ,end= " ")
    print()

