###1418083 최희태

for i in range(1,6) :
    for j in range(i, 6) :
        print(j, end="")
    print()

print("------------------------------------------------------------------------------------------")

###1418083 최희태

for i in range(1,6) : #i=1,2,3,4,5
    for j in range(i, i+1) : #i=1 1,2까지출력 = 1, i=2는 2에서 3까지 =2
        print(j, end="")
    print()

print("------------------------------------------------------------------------------------------")

###1418083 최희태

for i in range(10):
    for j in range(i, 10):
        print(j,end ="")
    print()

print("------------------------------------------------------------------------------------------")

###1418083 최희태

n=6
for i in range(n): #n=6, i=0,1,2,3,4,5
    for j in range(n-(i+1)): # 6-(0+1),6-(1+1)...
        print(j, end='')
    for j in range(i+1):
        print('@', end='')
    print()

print("------------------------------------------------------------------------------------------")

for a in range(3):
    for b in range(4):
        print(a, ",",b, end=" ")
    print()